data = {
        "Возраст 1":
            {
                "Жанр 1":
                {
                    "Поджанр 1":
                        [
                            {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                        ],
                    "Поджанр 2":
                        [
                            {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                            {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                        ]
                },
                "Жанр 2":
                    {
                        "Поджанр 1":
                            [
                                {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                            ],
                        "Поджанр 2":
                            [
                                {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                            ]
                    },
            },
        "Возраст 2":
            {
                "Жанр 1":
                    {
                        "Поджанр 1":
                            [
                                {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                            ],
                        "Поджанр 2":
                            [
                                {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                            ]
                    },
                "Жанр 2":
                    {
                        "Поджанр 1":
                            [
                                {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                            ],
                        "Поджанр 2":
                            [
                                {"title": "Книга 1", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 2", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 3", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 4", "author": "Автор", "desc": "Описание книги"},
                                {"title": "Книга 5", "author": "Автор", "desc": "Описание книги"},
                            ]
                    },
            }
    }
